package xCloud.andy;

import java.util.Arrays;
import java.util.List;

/**
 *@Description
 *@Author Andy Fan
 *@Date 2025/2/7 17:55
 *@ClassName staff
 */
public class staff
{
   public static void main( String[] args )
   {
      //      梁东明;鲍传东;毕小靓;毕玉杰;蔡淇;蔡晓雨;蔡西希;操浩;曹冬;曹路丽;曹路洋;曹文雅;陈婵玉;陈丹丹;程贝贝(贝贝吖);程杰;程沛民;成蓉;程帅;程鑫磊;陈江华;陈可可(Clear the passt);陈立(北海有鲲);陈丽;陈丽芬;陈露;陈露;陈美红;陈秋晔;陈爽;陈思阳;陈婷婷;陈薇虹;陈文杰;陈文新;陈亚娟(明阳);陈远(HR-夏天);陈振天;陈珍珍(珍珍);陈祖敏;丛敬锐;代标;戴华思(综合);戴远洋;邓和香(邓（在职员工推荐好友入职奖励500元/人）);邓荣;邓声华(Aiden);丁家奎;丁婧;丁娜;董春妹;董楠;董琴;董雪芹;杜春梅(Cici);杜丽丽;杜琳;樊春杰;方圆;方芸;范蓉梅;范兴伟;樊迎宾(风清扬);冯博冉;冯凡;冯棉棉;冯旭仰(冯旭仰);封婷;付加飞;干勇(招聘部经理~阿勇);高超;高辉;高乃强;高思佳;高昕(给我优质简历);高兆坤;高枝兴;高子丹;巩梦瑶(综合);谷心雨;管安琴(综合);顾金君;古明成;郭佳怡;郭金龙;郭梦龙;郭梦昀;郭爽;韩达;郝书娜(综合);何秀梅;何一鸣;侯新宝;厚楷乐(乐乐);黄容;黄祥辉;黄雪琪(金融);胡梦;胡晓芬;贾堪;贾翔;蒋涵彬(金融);蒋江河;姜珊;简彦婷;蹇勇莉;季春辉;解子赏;靳大伟(HR-大伟);景蓓琦;鞠婵;可爱有趣的仁小联;孔德玉(平凡);孔莎莎;赖芬;赖小静;李艾檬;梁洁;廖春春;李波;李飞扬;李公元;李国龙;李佳颖;李晶晶;李继松;林峰;李宁;李诺;李强;刘博;刘畅;刘德海;刘佳;刘佳佳(珊珊);刘磊(金融);刘玲;刘岭云(小鹿);刘伟伟;刘霄;刘晓宗;刘旋;刘妍彤;刘裔龙(王海杰爱徒);刘宇扬;刘子轩;李晓芳;李小莉;李曦民(综合);李岩;李怡芸;李智;陆丽华;陆琳妍;陆松娟;鲁杰;路梅;卢朦;卢奇龙;卢婷婷;卢燕(小鹿);路志华;吕凯君;吕琴;吕心阳;马龙;毛杰;毛小花;毛艳;马小宝;马小凡;孟雨欣(金融);莫智儿;穆丰雪;倪斌(明阳);倪欢欢;宁玉杰;倪瑞霞;牛杰;牛磊;牛立岩;牛孟涛;牛培娟(Vincy);牛新杰;牛永健;牛振(小泥人);潘高洁;潘金荣;潘罗丹(在职员工推荐好友奖励500元/人);潘荣荣(综合);潘若怡;潘弯弯;潘秀茹;潘扬;潘玉康;裴守鹏;彭静;企微直播;乔亚萍;秦晓敏;渠永强;饶志康;仁联企服招聘(仁联招聘);阮永;沙芊芊(金融);尚振兴;邵彬亮(圆饼);邵晓燕;邵芯怡;盛皖肖;申雪;施阿杰(欢喜);施俊高;史申申;史万贤;时英豪;束平平;宋瑞;宋永毫;苏孟杰(人事-孟孟);孙草原(集团事业部经理-孙中原);孙洁;孙金玉;孙乐;孙权;孙伟;孙文文;孙晓泳;孙雨晴;孙瑜锋;孙正梁;唐贵芳(唐琪);唐婧(wing);陶凌文(HR-Seagull);滕嫒(小爱);田佳曦;田晓菲;田玉慧(综合);童中胜(招聘经理  童经理);万进炉(集团直聘事业部-周奇);万荣佳;万正;王嫒丽(Ada);王超;王超(白隼);王成铖;王晨旭(综合);王春艳;王蝶;王帆;王芳;王海杰(招聘经理  王经理);王海艳;王红;王佳丹;王建尧(王不易);王巨超(王先生);王丽娟(HR 桃子);王林峰;王萍;王爽;王天嵘;王同杰;王卫军;王文林(集团事业部～HR耀林);王消;王晓阳(王海杰部门);王雪;王艺颖;王永晨(陈杰夫 Jeffrey 人事部);王永生;王瑜;王玉娇;王元芳;王子瑶;汪艳;汪勇;汪永美;韦静静;韦琴琴;翁宇;吴成波(菠萝);吴昊;吴慧敏(HR-小白（在线版）);吴佳璐;吴健;吴娇;吴嘉树(Danny);吴兰芳;吴敏;吴巧兰;吴桤晟;吴秋萍;武艳;吴燕;吴悦;夏如招;项宗一;冼雅斯;谢贝贝;谢明润(金融);辛玉;熊凤箐;修相宇;奚媛媛(西西呀);徐金怡;许可(coco);徐瑮;徐茜;许士玺;徐婷婷;许杨;徐奕;徐钟仁;薛锋;薛梓威;燕蓉;杨红娟;杨静;杨坤;杨玲;杨敏;杨娜;杨蓉;杨秀(人事秀秀);杨洋;杨章卫;杨振光;杨志念;杨志锐;晏辉;严幸;姚晨晨(综合);姚停停(明阳);叶亮;叶明慧;叶威;殷蕾(阿拉蕾);俞佳璐;俞昕翔;俞祎凡;余克伟;余龙腾(金融);余文韬;余小芬(HR-芒果（鸽子勿扰）);喻杨(综合);袁芳;袁磊;袁小颖;袁新宇(金融);岳凤莹;翟盼(在人山人海🍉);张晨曦;张凤梅;张桂兰;张果玲;张海霞(人事-南风🌿);张红光;张健(阿张);张建东;张晶;张立;张羚;张芹;张晴;张仁山;张石林(南方男);张微微(Ivy);张稳;章小伟(HR-消音);张小翔;张雪艳;张亚凯;张阳;张勇;张永壮;张玉;张雨;张子枫;詹健(综合);赵斌;赵德艳(明阳);赵锋;赵赫(赵云);赵金帅;赵刘松;赵晓;赵晓岚;赵晓玲;赵洋(易小川);赵颖超;赵跃强;郑飞;郑林杰;郑燕(金融);钟沙临;周金凤(招聘HR周周);周锦辉;周乐;周清;周文艳;周小娅(鱼周周);周亚宁;周悦;祝洁;朱金亚;朱清清;朱怡琳;朱奕鑫;朱园园;左腾;祖燕
      String str = "梁东明;鲍传东;毕小靓;毕玉杰;蔡淇;蔡晓雨;蔡西希;操浩;曹冬;曹路丽;曹路洋;曹文雅;陈婵玉;陈丹丹;程贝贝(贝贝吖);程杰;程沛民;成蓉;程帅;程鑫磊;陈江华;陈可可(Clear the passt);陈立(北海有鲲);陈丽;陈丽芬;陈露;陈露;陈美红;陈秋晔;陈爽;陈思阳;陈婷婷;陈薇虹;陈文杰;陈文新;陈亚娟(明阳);陈远(HR-夏天);陈振天;陈珍珍(珍珍);陈祖敏;丛敬锐;代标;戴华思(综合);戴远洋;邓和香(邓（在职员工推荐好友入职奖励500元/人）);邓荣;邓声华(Aiden);丁家奎;丁婧;丁娜;董春妹;董楠;董琴;董雪芹;杜春梅(Cici);杜丽丽;杜琳;樊春杰;方圆;方芸;范蓉梅;范兴伟;樊迎宾(风清扬);冯博冉;冯凡;冯棉棉;冯旭仰(冯旭仰);封婷;付加飞;干勇(招聘部经理~阿勇);高超;高辉;高乃强;高思佳;高昕(给我优质简历);高兆坤;高枝兴;高子丹;巩梦瑶(综合);谷心雨;管安琴(综合);顾金君;古明成;郭佳怡;郭金龙;郭梦龙;郭梦昀;郭爽;韩达;郝书娜(综合);何秀梅;何一鸣;侯新宝;厚楷乐(乐乐);黄容;黄祥辉;黄雪琪(金融);胡梦;胡晓芬;贾堪;贾翔;蒋涵彬(金融);蒋江河;姜珊;简彦婷;蹇勇莉;季春辉;解子赏;靳大伟(HR-大伟);景蓓琦;鞠婵;可爱有趣的仁小联;孔德玉(平凡);孔莎莎;赖芬;赖小静;李艾檬;梁洁;廖春春;李波;李飞扬;李公元;李国龙;李佳颖;李晶晶;李继松;林峰;李宁;李诺;李强;刘博;刘畅;刘德海;刘佳;刘佳佳(珊珊);刘磊(金融);刘玲;刘岭云(小鹿);刘伟伟;刘霄;刘晓宗;刘旋;刘妍彤;刘裔龙(王海杰爱徒);刘宇扬;刘子轩;李晓芳;李小莉;李曦民(综合);李岩;李怡芸;李智;陆丽华;陆琳妍;陆松娟;鲁杰;路梅;卢朦;卢奇龙;卢婷婷;卢燕(小鹿);路志华;吕凯君;吕琴;吕心阳;马龙;毛杰;毛小花;毛艳;马小宝;马小凡;孟雨欣(金融);莫智儿;穆丰雪;倪斌(明阳);倪欢欢;宁玉杰;倪瑞霞;牛杰;牛磊;牛立岩;牛孟涛;牛培娟(Vincy);牛新杰;牛永健;牛振(小泥人);潘高洁;潘金荣;潘罗丹(在职员工推荐好友奖励500元/人);潘荣荣(综合);潘若怡;潘弯弯;潘秀茹;潘扬;潘玉康;裴守鹏;彭静;企微直播;乔亚萍;秦晓敏;渠永强;饶志康;仁联企服招聘(仁联招聘);阮永;沙芊芊(金融);尚振兴;邵彬亮(圆饼);邵晓燕;邵芯怡;盛皖肖;申雪;施阿杰(欢喜);施俊高;史申申;史万贤;时英豪;束平平;宋瑞;宋永毫;苏孟杰(人事-孟孟);孙草原(集团事业部经理-孙中原);孙洁;孙金玉;孙乐;孙权;孙伟;孙文文;孙晓泳;孙雨晴;孙瑜锋;孙正梁;唐贵芳(唐琪);唐婧(wing);陶凌文(HR-Seagull);滕嫒(小爱);田佳曦;田晓菲;田玉慧(综合);童中胜(招聘经理  童经理);万进炉(集团直聘事业部-周奇);万荣佳;万正;王嫒丽(Ada);王超;王超(白隼);王成铖;王晨旭(综合);王春艳;王蝶;王帆;王芳;王海杰(招聘经理  王经理);王海艳;王红;王佳丹;王建尧(王不易);王巨超(王先生);王丽娟(HR 桃子);王林峰;王萍;王爽;王天嵘;王同杰;王卫军;王文林(集团事业部～HR耀林);王消;王晓阳(王海杰部门);王雪;王艺颖;王永晨(陈杰夫 Jeffrey 人事部);王永生;王瑜;王玉娇;王元芳;王子瑶;汪艳;汪勇;汪永美;韦静静;韦琴琴;翁宇;吴成波(菠萝);吴昊;吴慧敏(HR-小白（在线版）);吴佳璐;吴健;吴娇;吴嘉树(Danny);吴兰芳;吴敏;吴巧兰;吴桤晟;吴秋萍;武艳;吴燕;吴悦;夏如招;项宗一;冼雅斯;谢贝贝;谢明润(金融);辛玉;熊凤箐;修相宇;奚媛媛(西西呀);徐金怡;许可(coco);徐瑮;徐茜;许士玺;徐婷婷;许杨;徐奕;徐钟仁;薛锋;薛梓威;燕蓉;杨红娟;杨静;杨坤;杨玲;杨敏;杨娜;杨蓉;杨秀(人事秀秀);杨洋;杨章卫;杨振光;杨志念;杨志锐;晏辉;严幸;姚晨晨(综合);姚停停(明阳);叶亮;叶明慧;叶威;殷蕾(阿拉蕾);俞佳璐;俞昕翔;俞祎凡;余克伟;余龙腾(金融);余文韬;余小芬(HR-芒果（鸽子勿扰）);喻杨(综合);袁芳;袁磊;袁小颖;袁新宇(金融);岳凤莹;翟盼(在人山人海\uD83C\uDF49);张晨曦;张凤梅;张桂兰;张果玲;张海霞(人事-南风\uD83C\uDF3F);张红光;张健(阿张);张建东;张晶;张立;张羚;张芹;张晴;张仁山;张石林(南方男);张微微(Ivy);张稳;章小伟(HR-消音);张小翔;张雪艳;张亚凯;张阳;张勇;张永壮;张玉;张雨;张子枫;詹健(综合);赵斌;赵德艳(明阳);赵锋;赵赫(赵云);赵金帅;赵刘松;赵晓;赵晓岚;赵晓玲;赵洋(易小川);赵颖超;赵跃强;郑飞;郑林杰;郑燕(金融);钟沙临;周金凤(招聘HR周周);周锦辉;周乐;周清;周文艳;周小娅(鱼周周);周亚宁;周悦;祝洁;朱金亚;朱清清;朱怡琳;朱奕鑫;朱园园;左腾;祖燕";
      String str_new = "梁东明;鲍传东;毕小靓;毕玉杰;蔡淇;蔡晓雨;蔡西希;操浩;曹冬;曹路丽;曹路洋;曹文雅;陈婵玉;陈丹丹;程贝贝(贝贝吖);程杰;程沛民;成蓉;程帅;程鑫磊;陈江华;陈可可(Clear the passt);陈立(北海有鲲);陈丽;陈丽芬;陈露;陈露;陈美红;陈秋晔;陈爽;陈思阳;陈婷婷;陈薇虹;陈文杰;陈文新;陈亚娟(明阳);陈远(HR-夏天);陈振天;陈珍珍(珍珍);陈祖敏;丛敬锐;代标;戴华思(综合);戴远洋;邓和香(邓（在职员工推荐好友入职奖励500元/人）);邓荣;邓声华(Aiden);丁家奎;丁婧;丁娜;董春妹;董楠;董琴;董雪芹;杜春梅(Cici);杜丽丽;杜琳;樊春杰;方圆;方芸;范蓉梅;范兴伟;樊迎宾(风清扬);冯博冉;冯凡;冯棉棉;冯旭仰(冯旭仰);封婷;付加飞;干勇(招聘部经理~阿勇);高超;高辉;高乃强;高思佳;高昕(给我优质简历);高兆坤;高枝兴;高子丹;巩梦瑶(综合);谷心雨;管安琴(综合);顾金君;古明成;郭佳怡;郭金龙;郭梦龙;郭梦昀;郭爽;韩达;郝书娜(综合);何秀梅;何一鸣;侯新宝;厚楷乐(乐乐);黄容;黄祥辉;黄雪琪(金融);胡梦;胡晓芬;贾堪;贾翔;蒋涵彬(金融);蒋江河;姜珊;简彦婷;蹇勇莉;季春辉;解子赏;靳大伟(HR-大伟);景蓓琦;鞠婵;可爱有趣的仁小联;孔德玉(平凡);孔莎莎;赖芬;赖小静;李艾檬;梁洁;廖春春;李波;李飞扬;李公元;李国龙;李佳颖;李晶晶;李继松;林峰;李宁;李诺;李强;刘博;刘畅;刘德海;刘佳;刘佳佳(珊珊);刘磊(金融);刘玲;刘伟伟;刘霄;刘晓宗;刘旋;刘妍彤;刘裔龙(王海杰爱徒);刘宇扬;刘子轩;李晓芳;李小莉;李曦民(综合);李岩;李怡芸;李智;陆丽华;陆琳妍;陆松娟;鲁杰;路梅;卢朦;卢奇龙;卢婷婷;卢燕(小鹿);路志华;吕凯君;吕琴;吕心阳;马龙;毛杰;毛小花;毛艳;马小宝;马小凡;孟雨欣(金融);莫智儿;穆丰雪;倪斌(明阳);倪欢欢;宁玉杰;倪瑞霞;牛杰;牛磊;牛立岩;牛孟涛;牛培娟(Vincy);牛新杰;牛永健;牛振(小泥人);潘高洁;潘金荣;潘罗丹(在职员工推荐好友奖励500元/人);潘荣荣(综合);潘若怡;潘弯弯;潘秀茹;潘扬;潘玉康;裴守鹏;彭静;企微直播;乔亚萍;秦晓敏;渠永强;饶志康;仁联企服招聘(仁联招聘);阮永;沙芊芊(金融);尚振兴;邵彬亮(圆饼);邵晓燕;邵芯怡;盛皖肖;申雪;施阿杰(欢喜);施俊高;史申申;史万贤;时英豪;束平平;宋瑞;宋永毫;苏孟杰(人事-孟孟);孙草原(集团事业部经理-孙中原);孙洁;孙金玉;孙乐;孙权;孙伟;孙文文;孙晓泳;孙雨晴;孙瑜锋;孙正梁;唐贵芳(唐琪);唐婧(wing);陶凌文(HR-Seagull);滕嫒(小爱);田佳曦;田晓菲;田玉慧(综合);童中胜(招聘经理  童经理);万进炉(集团直聘事业部-周奇);万荣佳;万正;王嫒丽(Ada);王超;王超(白隼);王成铖;王晨旭(综合);王春艳;王蝶;王帆;王芳;王海杰(招聘经理  王经理);王海艳;王红;王佳丹;王建尧(王不易);王巨超(王先生);王丽娟(HR 桃子);王林峰;王萍;王爽;王天嵘;王同杰;王卫军;王文林(集团事业部～HR耀林);王消;王晓阳(王海杰部门);王雪;王艺颖;王永晨(陈杰夫 Jeffrey 人事部);王永生;王瑜;王玉娇;王元芳;王子瑶;汪艳;汪勇;汪永美;韦静静;韦琴琴;翁宇;吴成波(菠萝);吴昊;吴慧敏(HR-小白（在线版）);吴佳璐;吴健;吴娇;吴嘉树(Danny);吴兰芳;吴敏;吴巧兰;吴桤晟;吴秋萍;武艳;吴燕;吴悦;夏如招;项宗一;冼雅斯;谢贝贝;谢明润(金融);辛玉;熊凤箐;修相宇;奚媛媛(西西呀);徐金怡;许可(coco);徐瑮;徐茜;许士玺;徐婷婷;许杨;徐奕;徐钟仁;薛锋;薛梓威;燕蓉;杨红娟;杨静;杨坤;杨玲;杨敏;杨娜;杨蓉;杨秀(人事秀秀);杨洋;杨章卫;杨振光;杨志念;杨志锐;晏辉;严幸;姚晨晨(综合);姚停停(明阳);叶亮;叶明慧;叶威;殷蕾(阿拉蕾);俞佳璐;俞昕翔;俞祎凡;余克伟;余龙腾(金融);余文韬;余小芬(HR-芒果（鸽子勿扰）);喻杨(综合);袁芳;袁磊;袁小颖;袁新宇(金融);岳凤莹;翟盼(在人山人海\uD83C\uDF49);张晨曦;张凤梅;张桂兰;张果玲;张海霞(人事-南风\uD83C\uDF3F);张红光;张健(阿张);张建东;张晶;张立;张羚;张芹;张晴;张仁山;张石林(南方男);张微微(Ivy);张稳;章小伟(HR-消音);张小翔;张雪艳;张亚凯;张阳;张勇;张永壮;张玉;张雨;张子枫;詹健(综合);赵斌;赵德艳(明阳);赵锋;赵赫(赵云);赵金帅;赵刘松;赵晓;赵晓岚;赵晓玲;赵洋(易小川);赵颖超;赵跃强;郑飞;郑林杰;郑燕(金融);钟沙临;周金凤(招聘HR周周);周锦辉;周乐;周清;周文艳;周小娅(鱼周周);周亚宁;周悦;祝洁;朱金亚;朱清清;朱怡琳;朱奕鑫;朱园园;左腾;祖燕";
      String str_new_0212 = "梁东明;鲍传东;毕小靓;毕玉杰;蔡淇;蔡晓雨;蔡西希;操浩;曹冬;曹路丽;曹路洋;曹文雅;陈婵玉;陈丹丹;程贝贝(贝贝吖);程杰;程沛民;成蓉;程帅;程鑫磊;陈江华;陈可可(Clear the passt);陈立(北海有鲲);陈丽;陈丽芬;陈露;陈露;陈美红;陈秋晔;陈爽;陈思阳;陈婷婷;陈薇虹;陈文杰;陈文新;陈亚娟;陈远(HR-夏天);陈珍珍(珍珍);陈祖敏;丛敬锐;代标;戴华思(综合);戴远洋;邓和香(邓（在职员工推荐好友入职奖励500元/人）);邓荣;邓声华(Aiden);丁家奎;丁婧;丁娜;董春妹;董楠;董琴;董雪芹;杜春梅(Cici);杜丽丽;杜琳;樊春杰;方园;方芸;范蓉梅;范兴伟;樊迎宾(风清扬);冯博冉;冯凡;冯棉棉;冯旭仰(冯旭仰);封婷;付加飞;干勇(招聘部经理~阿勇);高超;高辉;高乃强;高思佳;高昕(给我优质简历);高兆坤;高枝兴;高子丹;巩梦瑶(综合);谷心雨;顾金君;古明成;郭佳怡;郭金龙;郭梦龙;郭梦昀;郭爽;韩达;郝书娜(综合);何秀梅;何一鸣;侯新宝;厚楷乐(乐乐);黄容;黄祥辉;黄雪琪(金融);胡梦;胡晓芬;贾堪;贾翔;蒋涵彬(金融);蒋江河;姜珊;简彦婷;蹇勇莉;季春辉;解子赏;靳大伟(HR-大伟);景蓓琦;鞠婵;可爱有趣的仁小联;孔德玉(平凡);孔莎莎;赖芬;赖小静;李艾檬;梁洁;廖春春;李波;李飞扬;李公元;李国龙;李佳颖;李晶晶;李继松;林峰;李宁;李诺;李强;刘博;刘畅;刘德海;刘佳;刘佳佳(珊珊);刘磊(金融);刘玲;刘伟伟;刘霄;刘晓宗;刘旋;刘妍彤;刘裔龙(王海杰爱徒);刘宇扬;刘子轩;李晓芳;李小莉;李曦民(综合);李岩;李怡芸;李智;陆丽华;陆琳妍;陆松娟;鲁杰;路梅;卢朦;卢奇龙;卢婷婷;卢燕(小鹿);路志华;吕凯君;吕琴;吕心阳;马龙;毛杰;毛小花;毛艳;马小宝;马小凡;孟雨欣(金融);莫智儿;穆丰雪;倪欢欢;宁玉杰;倪瑞霞;牛杰;牛磊;牛立岩;牛孟涛;牛培娟(Vincy);牛新杰;牛永健;牛振(小泥人);潘高洁;潘金荣;潘罗丹(在职员工推荐好友奖励500元/人);潘荣荣(综合);潘若怡;潘弯弯;潘秀茹;潘扬;潘玉康;裴守鹏;彭静;企微直播;乔亚萍;秦晓敏;渠永强;饶志康;仁联企服招聘(仁联招聘);阮永;尚振兴;邵彬亮(圆饼);邵晓燕;邵芯怡;盛皖肖;申雪;施阿杰(欢喜);施俊高;史申申;史万贤;时英豪;束平平;宋瑞;宋永毫;苏孟杰(人事-孟孟);孙草原(集团事业部经理-孙中原);孙洁;孙金玉;孙乐;孙权;孙伟;孙文文;孙晓泳;孙雨晴;孙瑜锋;孙正梁;唐贵芳(唐琪);唐婧(wing);陶凌文(HR-Seagull);滕嫒(小爱);田佳曦;田晓菲;田玉慧(综合);童中胜(招聘经理  童经理);万进炉(集团直聘事业部-周奇);万荣佳;万正;王嫒丽(Ada);王超;王超(白隼);王成铖;王春艳;王蝶;王帆;王芳;王海杰(招聘经理  王经理);王海艳;王红;王佳丹;王建尧(王不易);王巨超(王先生);王丽娟(HR 桃子);王林峰;王萍;王爽;王天嵘;王同杰;王卫军;王文林(集团事业部～HR耀林);王消;王晓阳(王海杰部门);王雪;王艺颖;王永晨(陈杰夫 Jeffrey 人事部);王永生;王瑜;王玉娇;王元芳;王子瑶;汪艳;汪勇;汪永美;韦静静;韦琴琴;翁宇;吴成波(菠萝);吴昊;吴慧敏(HR-小白（在线版）);吴佳璐;吴健;吴娇;吴嘉树(Danny);吴兰芳;吴敏;吴巧兰;吴桤晟;吴秋萍;武艳;吴燕;吴悦;夏如招;项宗一;冼雅斯;谢贝贝;谢明润(金融);辛玉;熊凤箐;修相宇;奚媛媛(西西呀);徐金怡;许可(coco);徐瑮;徐茜;许士玺;徐婷婷;许杨;徐奕;徐钟仁;薛锋;薛梓威;燕蓉;杨红娟;杨静;杨坤;杨玲;杨敏;杨娜;杨蓉;杨洋;杨章卫;杨振光;杨志念;杨志锐;晏辉;严幸;姚晨晨(综合);姚停停(明阳);叶亮;叶明慧;叶威;殷蕾(阿拉蕾);俞佳璐;俞昕翔;俞祎凡;余克伟;余龙腾(金融);余文韬;余小芬(HR-芒果（鸽子勿扰）);袁芳;袁磊;袁小颖;袁新宇(金融);岳凤莹;翟盼(在人山人海\uD83C\uDF49);张晨曦;张凤梅;张桂兰;张果玲;张海霞(人事-南风\uD83C\uDF3F);张红光;张健(阿张);张建东;张晶;张立;张羚;张芹;张晴;张仁山;张石林(南方男);张微微(Ivy);张稳;章小伟(HR-消音);张小翔;张雪艳;张亚凯;张阳;张勇;张永壮;张玉;张雨;张子枫;赵斌;赵德艳(明阳);赵锋;赵赫(赵云);赵金帅;赵刘松;赵晓;赵晓岚;赵晓玲;赵洋(易小川);赵颖超;赵跃强;郑飞;郑林杰;郑燕(金融);钟沙临;周金凤(招聘HR周周);周锦辉;周乐;周清;周文艳;周小娅(鱼周周);周亚宁;周悦;祝洁;朱金亚;朱清清;朱怡琳;朱奕鑫;朱园园;左腾;祖燕";

      String[] split_source_0207 = str.split( ";" );
      String[] split_source_new = str_new_0212.split( ";" );
      int count = 1;
      List< String > list_source_new = Arrays.asList( split_source_new );
      int count1 = 0;

      StringBuilder sb = new StringBuilder();
      for ( String string : split_source_0207 )
      {
         if ( !list_source_new.contains( string ) )
         {
            count1++;
            sb.append( count1 + ":" + string + "\n" );
         }
         System.out.println( count++ + ":" + string );
      }
      System.out.println( "---------------" );
      if ( !sb.isEmpty() )
      {
         System.out.println( "近期离职员工：\n" + sb );
         System.out.println( "---------------" );
      }
      else
      {
         System.out.println( "近期离职员工：\n" + "无" );
         System.out.println( "---------------" );
      }
   }
}
